/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50562
Source Host           : 127.0.0.1:3306
Source Database       : pet

Target Server Type    : MYSQL
Target Server Version : 50562
File Encoding         : 65001

Date: 2020-07-23 08:31:20
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for petdetail
-- ----------------------------
DROP TABLE IF EXISTS `petdetail`;
CREATE TABLE `petdetail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pno` int(30) DEFAULT NULL,
  `name` varchar(30) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `birth` date DEFAULT NULL,
  `sex` varchar(30) DEFAULT NULL,
  `picture` varchar(255) DEFAULT NULL,
  `brief` text,
  `kind` int(11) DEFAULT NULL,
  `state` varchar(255) DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of petdetail
-- ----------------------------
INSERT INTO `petdetail` VALUES ('1', '1', '苏格兰折耳猫', '2', '2018-10-24', '女', 'images/cat/cat1.jpg', '苏格兰折耳猫有两个类型：折耳和立耳(普通耳)。折耳是由于不完整的显性基因突变造成的。 苏格兰折耳猫非常能吃苦耐劳，继承了祖先看仓库猫的特点。它的外表与其温柔的性格非常吻合，叫声很轻，很少大声讲话。它乐意与人为伴，并用它特有的这种安宁的方式来表达。', '1', '');
INSERT INTO `petdetail` VALUES ('2', '2', '波斯猫', '1', '2019-01-01', '男', 'images/cat/cat2.jpg', '波斯猫(Persian) 猫中贵族，性情温文尔雅，聪明敏捷，善解人意，少动好静，叫声尖细柔美，爱撒娇，举止风度翩翩，天生一副娇生惯养之态，给人一种华丽高贵的感觉。历来深受世界各地爱猫人士的宠爱，是长毛猫的代表。波斯猫体格健壮、有力，躯体线条简洁流畅;圆脸、扁鼻、腿粗短，耳小、眼大、尾短圆。波斯猫的背毛长而密，质地如棉，轻如丝;毛色艳丽，光彩华贵，变化多样。', '1', '');
INSERT INTO `petdetail` VALUES ('3', '3', '布偶猫', '3', '2017-01-03', '女', 'images/cat/cat3.jpg', '布偶猫又称布拉多尔猫，是猫中体型和体重最大的一种猫。头呈V形，眼大而圆，被毛丰厚，四肢粗大，尾长，身体柔软，多为三色或双色猫。布偶猫性格温顺和好静，对人非常友善，忍耐性强，常被误认为缺乏疼痛感。布偶猫由于能容忍孩子的抓弄，最适宜有孩子的家庭饲养。', '1', '');
INSERT INTO `petdetail` VALUES ('4', '4', '美国短毛猫', '4', '2016-04-09', '女', 'images/cat/cat4.jpg', '美国短毛猫素以体格魁伟，骨胳粗壮，肌肉发达，生性聪明，温顺而著称，是短毛猫类中大型品种。该猫被毛厚密，毛色多达30余种，其中银色条纹品种尤为名贵。', '1', '');
INSERT INTO `petdetail` VALUES ('5', '5', '暹罗猫', '1', '2019-01-09', '女', 'images/cat/cat5.png', '暹罗猫，英文名称：Siamese。暹罗猫又称西母猫、泰国猫，是世界著名的短毛猫，也是短毛猫的代表品种。种族历史暹罗猫原产于泰国(故名暹罗)，在 200多年前，这种珍贵的猫仅在泰国的土宫和大寺院中饲养，是足不出户的贵族。', '1', '');
INSERT INTO `petdetail` VALUES ('6', '6', '狸花猫', '4', '2017-09-08', '男', 'images/cat/cat6.jpg', '中国是狸花猫的源产地，它属于自然猫，因为是在千百年中经过许多品种的自然淘汰而保留下来的品种。人们最熟悉的就要算是“狸猫换太子”(宋朝)的故事了，这也是能够找到的最早有关于狸花猫的记录了。它受人们喜欢，因为它有非常漂亮的被毛，健康的身体，特别容易喂养，并且对捕捉老鼠是十分的在行。 注意：不是所有虎斑猫都是狸花猫。(即使它有“M”形纹，其实所有虎斑猫都有这样的额纹和线状眼纹)', '1', '');
INSERT INTO `petdetail` VALUES ('7', '7', '英国短毛猫', '2', '2018-10-24', '男', 'images/cat/cat7.png', '英国短毛猫有悠久的历史，但直到20世纪初才引起人们的宠爱。该猫体形圆胖，外型 由中型至大型。其骨架及肌肉很发达，短而肥的颈与及阔而平的肩膊相配合。头部圆而阔， 体粗短发达，被毛短而密，头大脸圆，大而圆的眼睛根据被毛不同而呈现各种颜色。最大的特征是支耳的距离很接近身。该猫温柔平静，对人友善，很容易饲养。', '1', '');
INSERT INTO `petdetail` VALUES ('8', '8', '金吉拉猫', '5', '2015-05-11', '女', 'images/cat/cat8.png', '高贵华丽，优雅文静，温顺而有个性，它柔情似水善解人意，喜爱与人接近，有爱干净有洁癖，具有跟人沟通的灵性训练有素的金吉拉极为听话，对主人更是亲近有加，自尊心强，因此不要随意呵斥它们，否则它们也会因生气而疏远你甚至以绝食来抗议呢!它很爱清洁，它的性格特点较为适合在室内饲养，可以说是理想的乖乖猫。', '1', '');
INSERT INTO `petdetail` VALUES ('9', '9', '安哥拉猫', '4', '2016-01-04', '女', 'images/cat/cat9.jpg', '安哥拉猫是最古老的品种之一，源于土耳其。16世纪传入欧洲，进入意大利和法国，尔后传入英国，主要分布在法国和英国，是当时最受欢迎的长毛品种。到19世纪中叶，由于波斯猫的出现，安哥拉猫的地位逐渐降低。目前，安哥拉猫主要分布在土耳其，其他地方数量已很少 。', '1', '');
INSERT INTO `petdetail` VALUES ('10', '10', '挪威森林猫', '2', '2018-10-24', '女', 'images/cat/cat10.jpg', '挪威森林猫，以自话直译的说法，就是挪威森林里的猫，这是斯堪地半岛特有的品种，其起源不明，常常以像妖精的猫出现在北欧的神话之中', '1', '');
INSERT INTO `petdetail` VALUES ('11', '11', '边境牧羊犬', '1', '2019-01-02', '女', 'images/dog/dog1.jpg', '边境牧羊犬（Border Collie）是世界上最聪明的宠物狗品种，是世界上最有活力的犬种之一。起初，它被称为“苏格兰牧羊犬”，来自英格兰的高地边界。边境牧羊犬被用来在盎格鲁-苏格兰边境牧羊，寿命为10-17年。', '2', '');
INSERT INTO `petdetail` VALUES ('12', '12', '金毛寻回犬', '3', '2017-04-05', '男', 'images/dog/dog2.jpg', '金毛寻回犬（Golden Retriever）最早在苏格兰繁殖。金毛寻回犬非常友善，服从，忠诚，并在服务犬方面做得很好。金毛寻回犬寿命为10-12年', '2', '');
INSERT INTO `petdetail` VALUES ('13', '13', '杜宾犬', '4', '2016-08-09', '女', 'images/dog/dog3.jpg', '杜宾犬（Doberman Pinscher）是一种十分凶猛的犬种，是非常好的家犬，寿命为9-12年。杜宾犬非常忠诚，聪明，无所畏惧，机警，充满活力和高度自信', '2', '');
INSERT INTO `petdetail` VALUES ('14', '14', '喜乐蒂牧羊犬', '2', '2018-10-24', '男', 'images/dog/dog4.jpg', '喜乐蒂牧羊犬（Shetland Sheepdog）由苏格兰牧羊犬犬和斯皮兹犬进行杂交而产生犬种。喜乐蒂牧羊犬充满活力，听话，非常适合在农场工作。喜乐蒂牧羊犬身体毛茸茸，受到世界上许多人的喜爱，寿命为12-13年。', '2', '');
INSERT INTO `petdetail` VALUES ('15', '15', '蝴蝶犬', '3', '2017-09-02', '女', 'images/dog/dog5.jpg', '蝴蝶犬（Papillon）拥有优美的皮毛和高耸的耳朵，小狗的眼睛，非常可爱，寿命为13到15年。', '2', '已领养');
INSERT INTO `petdetail` VALUES ('16', '16', '拉布拉多犬', '2', '2018-10-24', '男', 'images/dog/dog6.jpg', '拉布拉多犬（Labrador retriever）非常忠诚和友善，非常适合家庭饲养，是世界上最受欢迎的犬种。拉布拉多犬被大量用作工作犬', '2', '');
INSERT INTO `petdetail` VALUES ('17', '17', '斗牛犬', '2', '2018-10-24', '女', 'images/dog/dog7.jpg', '斗牛犬（Bulldog）也称为英国斗牛犬，是一种中型犬种。斗牛犬肌肉发达，脸上有皱纹，鼻子有明显的俯卧。\r\n ', '2', '');
INSERT INTO `petdetail` VALUES ('18', '18', '德国牧羊犬', '1', '2019-09-29', '男', 'images/dog/dog8.jpg', '德国牧羊犬（German Shepherd）可以作为警犬，也可以作为搜救犬，还被用于机场嗅探非法物品。德国牧羊犬是出色的护卫犬，非常忠诚和聪明。', '2', '');
INSERT INTO `petdetail` VALUES ('19', '19', '贵宾犬', '1', '2019-03-21', '男', 'images/dog/dog9.jpg', '贵宾犬（Poodle）是20年来最受欢迎的犬种之一。贵宾犬非常忠诚，友善和聪明，在较早的时候已在马戏团中表演。', '2', '');
INSERT INTO `petdetail` VALUES ('20', '20', '比格犬', '1', '2019-02-02', '男', 'images/dog/dog10.jpg', '比格犬（Beagle）由于具有惊人的嗅觉和狩猎能力而被饲养。比格犬皮毛非常柔软，耳朵松软，非常可爱。比格犬经常在机场中使用，其嗅觉非常灵敏，即使在拥挤的机场中，也可以检测到任何非法物品。', '2', '');
INSERT INTO `petdetail` VALUES ('21', '21', '越南大肚猪', '3', '2017-09-07', '女', 'images/pig/pig1.jpg', '越南大肚猪可能是今天最流行的品种。它们拥有吸引人的外形和驯服的性格。他们夸张的背部和大肚子(其他动物喂的过饱的标志)是完全正常和健康的。它们平均身高大约35厘米，平均体重大约45斤。', '3', '');
INSERT INTO `petdetail` VALUES ('22', '22', '胡利亚尼猪(彩绘小猪)', '3', '2017-02-21', '女', 'images/pig/pig2.jpg', '胡利亚尼猪(彩绘小猪)真的很小，平均身高25-40厘米，体重13.5-45斤。和大肚猪一样，它们性格温顺，还喜欢玩玩具。', '3', '');
INSERT INTO `petdetail` VALUES ('23', '23', '非洲俾格米或几内亚猪', '2', '2018-10-24', '男', 'images/pig/pig3.jpg', '非洲俾格米或几内亚猪是真正的小猪。这些小猪重约18-36斤，平均身高35-56厘米。它们活泼好动、警惕性高并且很聪明。相对于大肚猪来说，非洲俾格米猪背很直。它们喜欢接近它们喜欢的人。 尤卡坦(墨西哥无毛)猪—这种小猪有小的也有不小的。较大的品种可以长到180斤以上，而小的只有平均45-90斤。它们平均身高40-61厘米。', '3', '');
INSERT INTO `petdetail` VALUES ('24', '24', '奥斯萨巴岛猪', '2', '2018-10-20', '女', 'images/pig/pig4.jpg', '平均身高35-50厘米，体重22.5-81斤，它们有梦幻般的气质，可以很好的和人们相处并且非常聪明。这种小猪可以活25年，所以养这种猪可以从自己的孩子很小的时候养到大学毕业。', '3', '');
INSERT INTO `petdetail` VALUES ('25', '25', '花斑仓鼠', '1', '2019-11-11', '男', 'images/hamster/hamster1.png', '花斑仓鼠身体介于白色和琥珀色的相间的称为琥珀花斑，眼睛为红色的，身体为为白色和黑色相间，称为熊猫或称为奶牛，眼睛有红色的，也有黑色的。', '4', '');
INSERT INTO `petdetail` VALUES ('26', '26', '琥珀仓鼠', '3', '2017-11-12', '女', 'images/hamster/hamster2.png', '琥珀仓鼠的毛发介于黄色和棕黄色之间的琥珀色，十分的漂亮。它的眼睛是红色的，性情亲近，是一种可爱的小宠物。', '4', '');
INSERT INTO `petdetail` VALUES ('27', '27', '黑熊仓鼠', '1', '2019-08-11', '男', 'images/hamster/hamster3.png', '黑熊仓鼠看起来全身上下都是黑色的，但实际上是深咖啡的色的毛发，并非全黑。在阳光下面有点发红，头颈和四肢的毛呈白色。', '4', '');
INSERT INTO `petdetail` VALUES ('28', '28', '雪球仓鼠', '2', '2018-10-23', '女', 'images/hamster/hamster4.png', '雪球仓鼠全身雪白，耳朵呈肉色，眼睛是红色的。它们的性格比较刚烈，而且胆小多疑，对声音也比较敏感。平时很喜欢睡觉，不喜欢运动。', '4', '');
INSERT INTO `petdetail` VALUES ('29', '29', '老公公仓鼠', '1', '2019-09-08', '女', 'images/hamster/hamster5.png', '老公公仓鼠的眼珠为黑色，白眉毛，白胡子，间或有一两根黑胡子，胡子细而密长。背毛为橙黄色，肚子上为白毛，体型娇小，胆小易惊，亲密度比较难培养，一般自家繁殖的二代老公公会比较好上手。', '4', '');
INSERT INTO `petdetail` VALUES ('30', '30', '布丁仓鼠', '2', '2018-10-22', '男', 'images/hamster/hamster6.png', '布丁仓鼠是有的日本繁育成功的，它们的毛色很纯，有一堆乌溜溜的大眼睛，模样十分可爱。', '4', '');
INSERT INTO `petdetail` VALUES ('31', '31', '虎皮鹦鹉', '1', '2019-09-08', '男', 'images/parrot/parrot1.jpg', '虎皮鹦鹉是鹦形目鹦鹉科的鸟类，又名娇凤，属小型攀禽品种，原产于澳大利亚的内陆地区，野生的虎皮鹦鹉栖息于林园、草地等处。结群活动，以植物种子等为食，繁殖期为6～1月，营巢于树洞中，每窝产卵4～8枚，孵化期为18天，性情活泼且易于驯养，在中国是大众最普遍常见的宠物鸟之一。', '5', '');
INSERT INTO `petdetail` VALUES ('32', '32', '金刚鹦鹉', '2', '2018-02-05', '女', 'images/parrot/parrot2.jpg', '金刚鹦鹉产于美洲热带地区，是色彩最漂亮，体型最大的鹦鹉之一，共有6属17个品种。具对趾足，每只脚有4只脚趾2前2后。尾极长，属大型攀禽。原生地是森林，特别是墨西哥及中南美洲的雨林。食谱由许多果实和花朵组成，食量大，有力的喙可将坚果啄开，用钝舌吸出果肉。在河岸的树上和崖洞里筑巢。比较容易接受人的训练，和其他种类的鹦鹉能够友好相处，但也会咬其他动物和陌生人，寿命最长可达70～80年。', '5', '');
INSERT INTO `petdetail` VALUES ('33', '33', '牡丹鹦鹉', '1', '2019-02-09', '男', 'images/parrot/parrot3.jpg', '牡丹鹦鹉亦称情侣鹦鹉、爱情鸟等，为鹦形目鹦鹉科鸟类，国内现有9个品种，为较珍贵的人工繁育鸟，常见的品种有琉璃腰牡丹鹦鹉（棕头牡丹鹦鹉）、黄领黑牡丹鹦鹉（黑头牡丹鹦鹉）、金红桃牡丹鹦鹉（桃脸黄牡丹鹦鹉）、小樱哥牡丹鹦鹉（桃脸绿牡丹鹦鹉）及蓝牡丹鹦鹉等品种。', '5', '');
INSERT INTO `petdetail` VALUES ('34', '34', '玄凤鹦鹉', '2', '2018-01-01', '男', 'images/parrot/parrot4.jpg', '玄凤鹦鹉又名鸡尾鹦鹉，在香港和台湾多称玄凤鹦鹉，是世界上最常见的中型鹦鹉之一，野生种群产自澳洲，繁殖数量多使得玄凤鹦鹉相当的普遍，手养幼鸟十分活泼，喜爱亲近主人。有许多的变种，较常见的是灰色、白色、珍珠等品种，在全世界的总数量超过1百万只，而且数量仍继续地成长中，其族群十分稳定且安全。', '5', '');
INSERT INTO `petdetail` VALUES ('35', '35', '和尚鹦鹉', '1', '2019-06-06', '女', 'images/parrot/parrot5.jpg', '和尚鹦鹉是典型的攀禽，鸟喙强劲有力，喙钩曲，上颌具有可活动关节，喙基部具有腊膜。肌肉质舌厚。脚短，强劲有力，对趾型，两趾向前两趾向后，适合抓握和攀援生活。雌鸟比雄鸟小10～20%。上体鲜绿色，前额和胸部浅灰色，腹部淡绿黄色，晚成雏。主要栖息于海拔1000米以下的干燥开阔林地、有荆棘灌木丛与仙人掌的热带稀树草原、棕榈树林、农业耕作区等地区。食物包括各种草，树木和其他植物的种子、芽和花，以及水果和浆果，偶尔食昆虫。', '5', '');
INSERT INTO `petdetail` VALUES ('36', '36', '三线闭壳龟', '10', '2010-08-08', '男', 'images/tortoise/tortoise5.jpg', '三线闭壳龟（学名：Cyclemystrifasciata），属于爬行纲龟鳖目龟科，又称金钱龟、金头龟、红肚龟，喜欢选择阴蔽的地方栖息，有群居的习性，每年冬天要冬眠。野生金钱龟极为稀少，在国际、国内市场上极为畅销。因具有食性广、抗病力和耐饥力强、生活力强等特点，人工饲养方便，具有可观的经济价值。此外，金钱龟还有极高的药用价值，是传统的中药材，为中国传统的出口商品之一。', '6', '');
INSERT INTO `petdetail` VALUES ('37', '37', '中华草龟', '8', '2012-02-02', '女', 'images/tortoise/tortoise4.jpg', '中华草龟（学名：Chinemysreevesiis）是我国龟类当中分布最广，在国际市场上，中华草龟十分畅销。日本、菲律宾以及欧美各国人民将其视为象征“吉祥，延年益寿”之物。中文学名：中华草龟，别称，金线龟、墨龟、泥龟、臭青龟、长寿龟。 草龟全身是宝，是《神农本草经》、《本草纲目》等中奉为食补和药补的上上品，常用来煲汤。李时珍说“介虫三百六十，而龟为长龟，介虫之灵长者也”', '6', '');
INSERT INTO `petdetail` VALUES ('38', '38', '黄喉拟水龟', '7', '2013-02-21', '男', 'images/tortoise/tortoise3.jpg', '黄喉拟水龟（学名：Mauremysmutica）为龟科拟水龟属的爬行动物。又名石龟、石金钱龟，水龟，黄板龟，黄龟，香龟，分布于越南、日本、台湾岛以及中国大陆的东部、南部、海南、西至云南等地，常见于丘陵地带半山区的山间盆地或河流谷地的水域中，常于附近的小灌丛或草丛中。该物种的模式产地在浙江舟山群岛。', '6', '');
INSERT INTO `petdetail` VALUES ('39', '39', '中华花龟', '6', '2014-03-03', '男', 'images/tortoise/tortoise2.jpg', '中华花龟（Ocadiasinensis）又名台湾草龟、六线草龟、珍珠龟等，属龟鳖目、淡水龟亚科、花龟属。自然界主要分布于广东、广西、海南、台湾等地。', '6', '');
INSERT INTO `petdetail` VALUES ('40', '40', '平胸龟', '5', '2015-04-04', '女', 'images/tortoise/tortoise1.jpg', '平胸龟（学名：Platysternonmegacephalum），属龟鳖目，平胸龟科，平胸龟属。俗名：鹰嘴龟，大头龟，鹰龟等。成年龟背甲长12～18cm左右，长椭圆形。龟壳扁平，头大尾长，不能缩入壳内。背甲有棕黄、褐色、黑色，墨绿等，背甲颜色与产地、环境、水质有关。尾长几乎与体长相等。趾间有半蹼，既利于陆地爬行，又便于水中游泳。平胸龟为水陆两栖，喜欢生活在满是巨砾和碎石的，水流湍急的山涧中。', '6', '');
INSERT INTO `petdetail` VALUES ('41', '41', '彩青蛙', '2', '2018-10-02', '男', 'images/fish/fish1.png', '\r\n彩青蛙\r\n它生活在中国东海与澳大利亚北部之间，喜欢藏身在近岸的礁石处。', '7', '');
INSERT INTO `petdetail` VALUES ('42', '42', '雀鱼', '1', '2019-09-03', '男', 'images/fish/fish2.png', '\r\n雀鱼\r\n属于一种热带鱼，雌雄鱼的体型和色彩差别较大，雌鱼没有雄鱼的色彩鲜艳。', '7', '');
INSERT INTO `petdetail` VALUES ('43', '43', '\r\n鲈科', '2', '2018-11-24', '女', 'images/fish/fish3.png', '鲈科\r\n在中国观赏鱼市场上并不常见，在1831年由波拿巴建立攀鲈科。', '7', '');
INSERT INTO `petdetail` VALUES ('44', '44', '\r\n狮王斗鱼', '1', '2019-04-05', '男', 'images/fish/fish4.png', '狮王斗鱼\r\n是泰国斗鱼品种中一种尾巴很漂亮的鱼。', '7', '');
INSERT INTO `petdetail` VALUES ('45', '45', '黄翅黄珍珠', '2', '2018-10-21', '女', 'images/fish/fish5.png', '\r\n黄翅黄珍珠\r\n中文俗名金边金点，原生地域在巴西，对水质变化较为敏感，需保持水质稳定。', '7', '');
